<?php
//使用utf-8编码，不然可能会出现乱码
header("Content-Type:text/html;charset=utf-8");

$a=2+3*5;  //值为17
echo '$a的值为：'.$a."<br/>";
$a+=3+4;  //$a=17+(3+4),值为24
echo '$a+=的值为：'.$a."<br/>";

$b=2;
$b-=3+4;  //$b=2-(3+4),值为-5
echo '$b-=的值为：'.$b."<br/>";
$b*=2+3;  //$b*(2+3),值为-25
echo '$b*=的值为：'.$b."<br/>";

$c=5;
$c/=5-4;  //$c=5/(5-4),值为5
echo '$c/=的值为：'.$c."<br/>";
$c.=2+3;  //$c=$c."2+3",值为"55"
echo '$c.=的值为：'.$c."<br/>";
var_dump($c);
echo "<br/>";

$d=14;
$d%=2+3;  //$d=14%(2+3),值为4
echo '$d%=的值为：'.$d."<br/>";
$e=$f=5;  //先将5赋值给$f，再将$f赋值给$e,值为5
echo '$e的值为：'.$e."<br/>";
echo '$f的值为：'.$f."<br/>";
?>